VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
    // Beat detection: Check if amplitude exceeds threshold
    if (amp > AMP_THRESHOLD) {
        // Generate a random RGB color (0-255)
        uint8_t r = rand() % 256;
        uint8_t g = rand() % 256;
        uint8_t b = rand() % 256;

        // Set all LEDs to the new random color
        for (int i = 0; i < MAX_LED; i++) {
            Set_LED(i, r, g, b);
        }

        // Update the last flash time to start a new fade cycle
        last_flash_time = current_time;
    }

    // Calculate elapsed time since the last flash
    uint32_t elapsed_time = current_time - last_flash_time;

    // Calculate brightness based on elapsed time
    int brightness;
    if (elapsed_time >= FADE_DURATION_MS) {
        brightness = 0;  // Fully faded out
    } else {
        // Linear fade: brightness decreases from BRIGHTNESS_MODE to 0
        brightness = brightness_mode - (brightness_mode * elapsed_time) / FADE_DURATION_MS;
    }

    // Apply the calculated brightness to the LEDs
    Set_Brightness(brightness);

    // Update the LED strip
    WS2812_Send();
}

void effect_dynamic_vu_meter(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    // Calculate ratio and number of LEDs to light
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        return;
    }

    int total_leds_to_light = (int)(ratio * MAX_LED);
    if (total_leds_to_light < 1) total_leds_to_light = 1;

    // Get color based on frequency
    uint8_t r, g, b;
    frequency_to_full_spectrum(peak_freq, &r, &g, &b);

    // Clear all LEDs first
    Turn_off_all_at_once();

    // Light LEDs from center outward
    int center = MAX_LED / 2;
    int leds_per_side = total_leds_to_light / 2;

    // Light center LED if odd number
    if (total_leds_to_light % 2 == 1) {
        Set_LED(center, r, g, b);
    }

    // Light LEDs on both sides of center
    for (int i = 1; i <= leds_per_side; i++) {
        if (center - i >= 0) {
            Set_LED(center - i, r, g, b);
        }
        if (center + i < MAX_LED) {
            Set_LED(center + i, r, g, b);
        }
    }

    int brightness = 5 + (int)(ratio * (brightness_mode - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

void effect_spectrum_color_bands(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    if (ratio <= 0.05f) {
        Turn_off_all_at_once();
        return;
    }

    // Define frequency bands and LED sections
    int low_start = 0;
    int low_end = MAX_LED / 3;
    int mid_start = low_end;
    int mid_end = (MAX_LED * 2) / 3;
    int high_start = mid_end;
    int high_end = MAX_LED;

    // Clear all LEDs
    Turn_off_all_at_once();

    // Determine which band the peak frequency falls into
    uint8_t r = 0, g = 0, b = 0;
    int start_led = 0, end_led = 0;

    if (peak_freq <= 250) {
        // Low frequency band - Red
        frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = low_start;
        end_led = low_end;
    } else if (peak_freq <= 2000) {
        // Mid frequency band - Green
    	frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = mid_start;
        end_led = mid_end;
    } else {
        // High frequency band - Blue
    	frequency_to_full_spectrum(peak_freq, &r, &g, &b);
        start_led = high_start;
        end_led = high_end;
    }

    // Light up the appropriate section
    for (int i = start_led; i < end_led; i++) {
        Set_LED(i, r, g, b);
    }

    int brightness = 5 + (int)(ratio * (brightness_mode - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

// Structure to hold pulse data
typedef struct {
    int position;           // Current position of pulse
    uint8_t r, g, b;       // Color of pulse
    uint8_t brightness;    // Brightness of pulse
    uint8_t length;        // Length of pulse in LEDs
    uint8_t active;        // Whether pulse is active
} Pulse;

#define MAX_PULSES 8
static Pulse pulses[MAX_PULSES];
static uint16_t last_amp = 0;
static uint32_t last_pulse_time = 0;

void effect_frequency_chase_gradient(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    const uint16_t BEAT_THRESHOLD = 800;  // Adjust based on your amp_maxn
    const uint32_t MIN_PULSE_INTERVAL = 100; // Minimum time between pulses (ms)

    uint32_t current_time = HAL_GetTick();

    // Beat detection: amplitude spike above threshold
    if (amplitude > BEAT_THRESHOLD &&
        amplitude > (last_amp + 200) &&
        (current_time - last_pulse_time) > MIN_PULSE_INTERVAL) {

        // Find an inactive pulse slot
        for (int i = 0; i < MAX_PULSES; i++) {
            if (!pulses[i].active) {
                // Initialize new pulse
                pulses[i].position = 0;
                frequency_to_full_spectrum(peak_freq, &pulses[i].r, &pulses[i].g, &pulses[i].b);

                float ratio = (float)amplitude / amp_maxn;
                if (ratio > 1.0f) ratio = 1.0f;

                pulses[i].brightness = (uint8_t)(ratio * 255);
                pulses[i].length = 3 + (uint8_t)(ratio * 8); // 3-11 LEDs long
                pulses[i].active = 1;

                last_pulse_time = current_time;
                break;
            }
        }
    }

    // Clear all LEDs
    Turn_off_all_at_once();

    // Update and draw all active pulses
    for (int i = 0; i < MAX_PULSES; i++) {
        if (pulses[i].active) {
            // Draw pulse with fade-out trail
            for (int j = 0; j < pulses[i].length; j++) {
                int led_pos = pulses[i].position - j;
                if (led_pos >= 0 && led_pos < MAX_LED) {
                    // Calculate fade factor for trail
                    float fade = 1.0f - ((float)j / pulses[i].length);
                    uint8_t r = (uint8_t)(pulses[i].r * fade);
                    uint8_t g = (uint8_t)(pulses[i].g * fade);
                    uint8_t b = (uint8_t)(pulses[i].b * fade);

