VuDaiDuong-23520359/MPU-MCU_project/STM32/Core/Src/main.c
                    // Blend with existing LED color (simple additive)
                    uint8_t existing_r = LED_Data[led_pos][2];
                    uint8_t existing_g = LED_Data[led_pos][1];
                    uint8_t existing_b = LED_Data[led_pos][3];

                    r = (r + existing_r > 255) ? 255 : r + existing_r;
                    g = (g + existing_g > 255) ? 255 : g + existing_g;
                    b = (b + existing_b > 255) ? 255 : b + existing_b;

                    Set_LED(led_pos, r, g, b);
                }
            }

            // Move pulse forward
            pulses[i].position++;

            // Deactivate pulse if it's moved off the strip
            if (pulses[i].position >= MAX_LED + pulses[i].length) {
                pulses[i].active = 0;
            }
        }
    }

    Set_Brightness(brightness_mode);
    WS2812_Send();

    last_amp = amplitude;
}

void effect_rainbow_roll(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    static float offset = 0.0f;

    float ratio = (float)amplitude / amp_maxn;
    if (ratio > 1.0f) ratio = 1.0f;

    // Cập nhật offset dựa vào tần số đỉnh
    offset += ((float)peak_freq / 100.0f);  // tốc độ cuộn
    if (offset >= 360.0f) offset -= 360.0f;

    for (int i = 0; i < MAX_LED; i++) {
        float hue = fmodf(offset + (i * (360.0f / MAX_LED)), 360.0f);
        uint8_t r, g, b;
        HSV_to_RGB(hue, 1.0f, ratio, &r, &g, &b);
        Set_LED(i, r, g, b);
    }

    int brightness = 5 + (int)(ratio * (brightness_mode - 5));
    Set_Brightness(brightness);
    WS2812_Send();
}

#define BASS_THRESHOLD 1200		// tăng để LED sáng hơn
#define BASS_FADE_MS 300		// tăng để LED tắt chậm hơn

void effect_bass_pulse_glow(uint16_t amplitude, uint16_t peak_freq, uint8_t brightness_mode) {
    static uint32_t last_bass_time = 0;
    static float hue = 0.0f;
    uint32_t now = HAL_GetTick();

    // Nếu là bass mạnh → cập nhật thời gian và màu sắc (hue)
    if (peak_freq <= 250 && amplitude > BASS_THRESHOLD) {
        last_bass_time = now;

        hue += 30.0f;  // Tăng hue để chuyển màu theo dải cầu vồng
        if (hue >= 360.0f) hue -= 360.0f;
    }

    // Tính độ sáng fade theo thời gian kể từ lần bass gần nhất
    uint32_t elapsed = now - last_bass_time;
    int brightness;

    if (elapsed >= BASS_FADE_MS) {
        brightness = 0;
    } else {
        brightness = brightness_mode - (brightness_mode * elapsed) / BASS_FADE_MS;
    }

    // Chuyển hue → RGB
    uint8_t r, g, b;
    HSV_to_RGB(hue, 1.0f, 1.0f, &r, &g, &b);  // Độ sáng sẽ được điều chỉnh sau bằng Set_Brightness()

    // Set toàn bộ LED thành màu đang có
    for (int i = 0; i < MAX_LED; i++) {
        Set_LED(i, r, g, b);
    }

    Set_Brightness(brightness);
    WS2812_Send();
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  srand(HAL_GetTick());
  uint8_t mode_button_index = 0;
  uint8_t brightness_button_count = 0;

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_TIM1_Init();
  MX_ADC1_Init();
  MX_TIM2_Init();
  /* USER CODE BEGIN 2 */



  HAL_TIM_Base_Start(&htim2);
  HAL_ADC_Start_IT(&hadc1);
  arm_rfft_fast_init_f32(&fftHandler, FFT_BUFFER_SIZE);

  float	peakVal	= 0.0f;
  HAL_Delay(50);


  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	  while (1)
	  {

	/////////////////////////////////////////////////////////////////////////////////////////
	// KHONG DUOC DONG VAO
			  if (fftReady){
				  peakVal = 0.0f;
				  peakHz = 0.0f;

				  uint16_t halfBins = FFT_BUFFER_SIZE / 2;
					  for (uint16_t k = 1; k < halfBins; k++) {
						  float re = fftBufOut[2 * k];
						  float im = fftBufOut[2 * k + 1];
						  float mag = sqrtf(re * re + im * im);
						  if (mag > peakVal) {
							  peakVal = mag;
							  peakHz  = (uint16_t)(k  * SAMPLE_RATE_HZ / (float)(FFT_BUFFER_SIZE));
						  }
					  }

					  fftReady = 0;
			  }
	/////////////////////////////////////////////////////////////////////////////////////////
	// CODE HIEU UNG BAT DAU TU DAY
			  if(HAL_GPIO_ReadPin(MODE_BUTTON_GPIO_Port, MODE_BUTTON_Pin) == 0)
			  {
				  while(HAL_GPIO_ReadPin(MODE_BUTTON_GPIO_Port, MODE_BUTTON_Pin) == 0) {}
				  mode_button_index = (mode_button_index + 1) % 6;
			  }
			  switch (mode_button_index) {
			  	  case 0: effect_flash_fade_random_color(amp, peakHz, brightness_mode); break;
			  	  case 1: effect_dynamic_vu_meter(amp, peakHz, brightness_mode); break;
			  	  case 2: effect_spectrum_color_bands(amp, peakHz, brightness_mode); break;
			  	  case 3: effect_frequency_chase_gradient(amp, peakHz, brightness_mode); break;
			  	  case 4: effect_rainbow_roll(amp, peakHz, brightness_mode); break;
			  	  case 5: effect_bass_pulse_glow(amp, peakHz, brightness_mode); break;
			  	  default: effect_flash_fade_random_color(amp, peakHz, brightness_mode); break;
			  }

			  if(HAL_GPIO_ReadPin(BRIGHTNESS_MODE_BUTTON_GPIO_Port, BRIGHTNESS_MODE_BUTTON_Pin) == 0){
				  while(HAL_GPIO_ReadPin(BRIGHTNESS_MODE_BUTTON_GPIO_Port, BRIGHTNESS_MODE_BUTTON_Pin) == 0) {}
				  brightness_mode = (uint8_t)((float)MAX_BRIGHTNESS * ((25.0f * (float)brightness_button_count) / 100.0f));
				  brightness_button_count = (brightness_button_count + 1) % 5;
			  }
		  HAL_Delay(2);
	/////////////////////////////////////////////////////////////////////////////////////////



    /* USER CODE END WHILE */

